BaseConfiguration/Money_2_0/InformationRegisters/ОперацииШаблонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОперацииШаблонов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПлановаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбменВалюты</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводИзменениеОстатка</v8:Type>
						<v8:Type>cfg:DocumentRef.Доход</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВзялиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.НамВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыДалиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.Перемещение</v8:Type>
						<v8:Type>cfg:DocumentRef.Расход</v8:Type>
						<v8:Type>cfg:DocumentRef.УниверсальнаяОперация</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбменВалюты</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводИзменениеОстатка</v8:Type>
						<v8:Type>cfg:DocumentRef.Доход</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВзялиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.НамВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыДалиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.Перемещение</v8:Type>
						<v8:Type>cfg:DocumentRef.Расход</v8:Type>
						<v8:Type>cfg:DocumentRef.УниверсальнаяОперация</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

BaseConfiguration/Money_2_0/InformationRegisters/ОперацииШаблонов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура ПроверитьЗаписиРегистра(БылиОшибки = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РС.Шаблон,
	|	РС.Операция
	|ИЗ
	|	РегистрСведений.ОперацииШаблонов КАК РС
	|ГДЕ
	|	РС.Шаблон.Ссылка ЕСТЬ NULL
	|	ИЛИ РС.Операция.Ссылка ЕСТЬ NULL";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.Шаблон) Или Не ЗначениеЗаполнено(Выборка.Операция) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			Набор = РегистрыСведений.ОперацииШаблонов.СоздатьНаборЗаписей();
			Набор.Отбор.Шаблон.Установить(Выборка.Шаблон);
			Набор.Отбор.Операция.Установить(Выборка.Операция);
			Набор.Записать(Истина);
		Исключение
			БылиОшибки = Истина;
			ЗаписьЖурналаРегистрации("Плановые операции", УровеньЖурналаРегистрации.Ошибка,,,
				СтрШаблон("Не удалось очистить записи операций шаблонов для шаблона ""%1"" и операции ""%2""
				|%3", Выборка.Шаблон, Выборка.Операция, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()))
				);
		КонецПопытки;
	
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
